app/views/cart/index.html.erb

<% @cart.each do | id, quantity | %>
    <% item = Item.find_by_id(id) %>
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]