app/controllers/items_controller.rb

SELECT "items".* FROM "items"
SELECT "items".* FROM "items" WHERE "items"."category" = ?  [["category", "Flowers"]]
---
  def index
    if params[:category].blank?
      @items = Item.all
    else
      @items = Item.where(category: params[:category])

INSERT INTO "items" ("title", "description", "image_url", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", ""], ["description", ""], ["image_url", "dsc_0483"], ["category", "Wildlife"], ["created_at", "2015-04-12 23:47:11.763145"], ["updated_at", "2015-04-12 23:47:11.763145"]]
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

UPDATE "items" SET "title" = ?, "description" = ?, "price" = ?, "image_url" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["title", ""], ["description", ""], ["price", nil], ["image_url", ""], ["updated_at", "2015-03-28 10:43:13.992810"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @item.update(item_params)